<!-- 首页部分，包含欢迎界面和历史摘要页 -->
import 'animate.css'

<template>
	<div id="welcome">
		<img alt="background" src="../assets/img/background.png">
		<h1 class="text">欢迎来到乐雅轩！</h1>
		<h2 class="text">此曲只应天上有，人生难得几回闻</h2>
	</div>
	<h1>民族音乐的发展历史</h1>
	<div id="history">
		<ul>
			<li v-for="(item, index) in period" :key="index">
				<button :class="{ 'selected': selectedIndex === index }" @click="select(index)">{{ item }}</button>
			</li>
		</ul>
		<div id="content">
			{{ msg[selectedIndex] }}
			<button />
			<button />
		</div>
	</div>
</template>

<script>
export default {
	name: 'HomePage',
	data() {
		return {
			period: ['夏、商', '周', '秦、汉', '三国、两晋、南北朝', '隋、唐', '宋、元', '明、清'],
			selectedIndex: 0,
			msg: [
				'根据文献记载，夏商两代为奴隶制社会早期。从古典文献记载来看，这时的乐舞已经渐渐脱离原始氏族乐舞为氏族共有的特点，它们更多地为高等阶级所占有。从内容上看，它们渐渐离开了原始的图腾崇拜，转而为对征服自然的人的颂歌。例如夏禹治水，造福人民，于是便出现了歌颂夏禹的乐舞《大夏》。夏桀无道，商汤伐之，于是便有了歌颂商汤伐桀的乐舞《大濩》。商代巫风盛行，于是出现了专司祭祀的巫（女巫）和觋（男巫）。他们为奴隶主所豢养，在行祭时舞蹈、歌唱，是最早以音乐为职业的人。奴隶主以乐舞来祭祀天帝、祖先，同时又以乐舞来放纵自身的享受。他们死后还要以乐人殉葬，这种残酷的殉杀制度一方面暴露了奴隶主的残酷统治，而在客观上也反映出生产力较原始时代的进步，从而使音乐文化具备了迅速发展的条件。 据史料记载，在夏代已经有用鳄鱼皮蒙制的鼍鼓。商代已经发现有木腔蟒皮鼓和双鸟饕餮纹铜鼓，以及制作精良的脱胎于石桦犁的石磬。青铜时代影响所及，商代还出现了编钟、编铙乐器，它们大多为三枚一组。各类打击乐器的出现体现了乐器史上击乐器发展在前的特点。始于公元前五千余年的体鸣乐器陶埙从当时的单音孔、二音孔发展到五音孔，它已可以发出十二个半音的音列。根据陶埙发音推断，中国民族音乐思维的基础五声音阶，出在新石器时代的晚期，而七声至少在商、殷时已经出现。',
				'西周是中国奴隶制的成熟时期，东周奴隶制社会由盛到衰，君主统治因素日趋增长的历史时期。西周时期宫廷首先建立了完备的礼乐制度。在宴享娱乐中不同地位的官员规定有不同的地位、舞队的编制。总结前历代史诗性质的典章乐舞，可以看到所谓“六代乐舞”，即黄帝时的《云门》，尧时的《咸池》，舜时的《韶》，禹时的《大夏》，商时的《大濩》，周时的《大武》。周代还有采风制度，收集民歌，以观风俗、察民情。赖于此，保留下大量的民歌，经春秋时孔子的删定，形成了中国第一部诗歌总集——《诗经》。它收有自西周初到春秋中叶五百多年的入乐诗歌一共三百零五篇。《诗经》中最优秀的部分是“风”。它们是流传于以河南省为中心，包括附近数省的十五国民歌。此外还有文人创作的“大雅”、“小雅”，以及史诗性的祭祀歌曲“颂”这几种体裁。就其流传下来的的文字分析，《诗经》中的歌曲以可概括为十种曲式结构。作为歌曲尾部的高潮部分，已有专门的名称“乱”。在《诗经》成书前后，著名的爱国诗人屈原根据楚地的祭祀歌曲编成《九歌》，具有浓重的楚文化特征。至此，两种不同不同音乐风格的作品南北交相辉映成趣。\n周代时期民间音乐生活涉及社会生活的十几个侧面，十分活跃。世传伯牙弹琴，钟子期知音的故事即始于此时。这反映出演奏技术、作曲技术以及人们欣赏水平的提高。古琴演奏中，琴人还总结出“得之于心，方能应之于器”的演奏心理感受。著名的歌唱乐人秦青的歌唱据记载能够“声振林木，响遏飞云”。更有民间歌女韩娥，歌后“余音饶梁，三日不绝”。这些都是声乐技术上的高度成就。\n周代音乐文化高度发达的成就还可以一九七八年湖北随县出土的战国曾侯乙墓葬中的古乐器为重要标志。这座可以和埃及金字塔媲美的地下音乐宝库提供了当时宫廷礼乐制度的模式，这里出土的八种一百二十四件乐器，按照周代的“八音”乐器分类法（金、石、丝、竹、匏、土、革、木）几乎各类乐器应有尽有。其中最为重要的六十四件编钟乐器，分上、中、下三层编列，总重量达五千余公斤，总音域可达五个八度。由于这套编钟具有商周编钟一钟发两音的特性，其中部音区十二个半音齐备，可以旋宫转调，从而证实了先秦文献关于旋宫记载的可靠。曾侯乙墓钟、磬乐器上还有铭文，内容为各诸侯国之间的乐律理论，反映着周代乐律学的高度成就。在周代，十二律的理论已经确立。五声阶名（宫、商、角、徵、羽）也已经确立。这时，人们已经知道五声或七声音阶中以宫音为主，宫音位置改变就叫旋宫，这样就可以达到转调的效果。律学上突出的成就见于《管子－地员篇》所记载的“三分损益法”。就是以宫音的弦长为基础，增加三分之一（益一），得到宫音下方的纯四度征音；征音的弦长减去三分之一（损一），得到征音上方的纯五度商音；以次继续推算就得到五声音阶各音的弦长。按照此法算全八度内十二个半音（十二律）的弦长，就构成了“三分损益律制”。这种律制由于是以自然的五度音程相生而成，每一次相生而成的音均较十二平均律的五度微高，这样相生十二次得不到始发律的高八度音，造成所谓“黄钟不能还原”，给旋宫转调造成不便。 但这种充分体现单音音乐旋律美感的律制一直延续至今。',
				'在秦汉时期，一个名为“乐府”的音乐机构开始出现。乐府不仅继承了周代的采风制度，搜集、整理和改编民间音乐，还集中了大量的乐工，为宴享、郊祀、朝贺等场合演奏。这些用于演唱的歌词，被人们称为乐府诗。随着时间的推移，乐府这个词的含义得到了扩展，它开始泛指各种入乐或不入乐的歌词，甚至一些戏曲和器乐作品也都被称为乐府。到了汉代，主要的歌曲形式变为了相和歌。这种歌曲形式从最初的“一人唱，三人和”的清唱开始，逐渐发展成为了有丝、竹乐器伴奏的“相和大曲”。相和大曲的结构独特，分为“艳--趋--乱”三个部分，对隋唐时期的歌舞大曲产生了重要影响。此外，汉代在西北边郡还兴起了鼓吹乐。这种音乐形式以不同编制的吹管乐器和打击乐器为特点，构成了多种鼓吹形式，如横吹、骑吹、黄门鼓吹等。这些鼓吹乐可以在马上演奏，也可以在行进中演奏，常用于军乐礼仪、宫廷宴饮以及民间娱乐活动。至今，我们仍可以在民间吹打乐中听到汉代鼓吹的遗绪。\n值得一提的是，汉代还出现了“百戏”。百戏是一种综合性的表演艺术，它将歌舞、杂技、角抵（即相扑）等不同的表演形式融合在一起，为观众带来丰富多彩的视听享受。在律学方面，汉代的成就也不可忽视。京房以三分损益的方法将八度音程划分为六十律，尽管这种理论在音乐实践上并无实际意义，但它却体现了律学思维的精微性。从理论上讲，这种划分方式甚至达到了五十三平均律的效果，为后世的音乐理论发展奠定了基础。',
				'由相和歌发展起来的清商乐在曹魏政权的重视，设置清商署。两晋之交的战乱，使清商乐与南方的吴歌、西曲融合。从而成为流传全国的重要乐种。\n这时，传统音乐文化的代表性乐器古琴趋于成熟，这主要表现为：在汉代已经出现了题解琴曲标题的古琴专著《琴操》。魏晋时竹林七贤之一，著名的琴家嵇康在其所著《琴赋》一书中有"徽以中山之玉"的记载。这说明当时的人们已经知道古琴上徽位泛音的产生（13徽）。当时，出现了一大批文人琴家相继出现，如嵇康、阮籍等，《广陵散》（《聂政刺秦王》）、《猗兰操》、《酒狂》等一批著名曲目问世。\n这一时期律学上的重要成就，包括晋代荀瑁找到管乐器的"管口校正数"。南朝宋何承天在三分损益法上，以等差迭加的办法，创立了十分接近十二平均律的新律。他的努力初步解决了三分损益律黄钟不能还原的难题。',
				'隋唐两代，政权统一，特别是唐代，政治稳定，经济兴旺，统治者奉行开放政策，不断吸收他方文化，加上魏晋以来已经孕育着的音乐文化打基础，终于萌发了以歌舞音乐为主要标志的音乐艺术的全面发展的高峰。\n唐代宫廷宴享的音乐，称作"燕乐"。隋、唐时期的七部乐、九部乐就属于燕乐。它们分别是中国及部分外国的民间音乐，主要有清商乐（汉族）、西凉乐（汉族）、高昌（今吐鲁番）乐、龟兹（今库车）乐、康国（今乌兹别克撒马尔罕）乐、安国（今乌兹别克布哈拉）乐、天竺（今印度）乐、高丽（今朝鲜）乐等。\n燕乐还分为坐部伎和立部伎演奏，根据白居易的《立部伎》诗，坐部伎的演奏员水平高于立部伎。风靡一时的唐代歌舞大曲是燕乐中独树一帜的奇葩。它继承了相和大曲的传统，融会了九部乐的精华，形成了散序——中序或拍序——破或舞遍的结构形式。见于《教坊录》著录的唐大曲曲名共有46个，其中《霓裳羽衣舞》以其为著名的皇帝音乐家唐玄宗所作，又兼有清雅的法曲风格，为世所称道。著名诗人白居易写有描绘该大曲演出过程的生动诗篇《霓裳羽衣舞歌》。\n在唐代的乐队中，琵琶是主要乐器之一。它已经与今日的琵琶形制相差无几。福建南曲和日本的琵琶，在形制上和演奏方法上还保留着唐琵琶的某些特点。\n受到龟兹音乐理论的影响，唐代出现了八十四调，燕乐二十八调的乐学理论。唐代曹柔还创立了减字谱的古琴记谱法，一直沿用至近代。\n唐代末年还盛行一种有故事情节，有角色和化妆表演，载歌载舞，同时兼有伴唱和管弦伴奏的歌舞戏。大面、踏摇娘、拨头、参军戏等这已经是一种小型的雏形戏曲。\n文学史上堪称一绝的唐诗在当时是可以入乐歌唱的。当时歌伎曾以能歌名家诗为快；诗人也以自己的诗作入乐后流传之广来衡量自己的写作水平。\n唐代音乐文化的繁荣还表现为有一系列音乐教育的机构，如教坊、梨园、大乐署、鼓吹署以及专门教习幼童的梨园别教园。这些机构以严密的考绩，造就着一批批才华出众的音乐家。',
				'宋时代音乐文化的发展以市民音乐的勃兴为重要标志，较隋唐音乐得到更为深入的发展。随着都市商品经济的繁荣，适应市民阶层文化生活的游艺场"瓦舍"、"勾栏"应运而生。在"瓦舍"、"勾栏"中人们可以听到叫声、嘌唱、小唱、唱赚等艺术歌曲的演唱；也可以看到说唱类音乐种类崖词、陶真、鼓子词、诸宫调，以及杂剧、院本的表演；可谓争奇斗艳、百花齐放。这当中唱赚中的缠令、缠达两种曲式结构对后世戏曲以及器乐的曲式结构有着一定的影响。而鼓子词则影响到后世的说唱音乐鼓词。诸宫调是这一时期成熟起来的大型说唱曲种。其中歌唱占了较重的分量。\n承隋唐曲子词发展的遗绪，宋代词调音乐获得了空前的发展。这种长短句的歌唱文学体裁可以分为引、慢、近、拍、令等等词牌形式。在填词的手法上已经有了"摊破"、"减字"、"偷声"等。南宋姜夔是既会作词，有能依词度曲的著名词家、音乐家。他有十七首自度曲和一首减字谱的琴歌《古怨》传世。这些作品多表达了作者关怀祖国人民的心情，描绘出清幽悲凉的意境，如《扬州慢》、《鬲溪梅令》、《杏花天影》等等。宋代的古琴音乐以郭楚望的代表作《潇湘水云》开古琴流派之先河。作品表现了作者爱恋祖国山河的盎然意趣。在弓弦乐器的发展长河中，宋代出现了"马尾胡琴"的记载。\n到了元代，民族乐器三弦的出现值得注意。在乐学理论上宋代出现了燕乐音阶的记载。同时，早期的工尺谱谱式也在张炎《词源》和沈括的《梦溪笔谈》中出现。近代通行的一种工尺谱直接导源于此时。宋代还是中国戏曲趋于成熟的时代。它的标志是南宋时南戏的出现。南戏又称温州杂剧、永嘉杂剧，其音乐丰富而自然。最初时一些民间小调，演唱时可以不受宫调的限制。后来发展为曲牌体戏曲音乐时，还出现了组织不同曲牌的若干乐句构成一种新曲牌的"集曲"形式。南戏在演唱形式上已有独唱、对唱、合唱等多种。传世的三种南戏剧本《张协状元》等见于《永乐大曲》。戏曲艺术在元代出现了以元杂剧为代表的高峰。元杂剧的兴盛最初在北方，渐次向南方发展，与南方戏曲发生交融。代表性的元杂剧作家有关汉卿、马致远、郑光祖、白朴，另外还有王实甫、乔吉甫，世称六大家。典型作品如关汉卿的《窦娥冤》，《单刀会》，王实甫的《西厢记》。元杂剧有严格的结构，即每部作品由四折（幕）一楔子（序幕或者过场）构成。一折内限用同一宫调，一韵到底，常由一个角色（末或旦）主唱，这些规则，有时也有突破，如王实甫的《西厢记》达五本二十折。元杂剧对南方戏曲的影响，造成南戏（元明之际叫做传奇）的进一步成熟。出现了一系列典型剧作，如《拜月庭》、《琵琶记》等等。这些剧本经历代流传，至今仍在上演。当时南北曲的风格 已经初步确立，以七声音阶为主的北曲沉雄；以五声音阶为主的南曲柔婉。随着元代戏曲艺术的发展，出现了最早的总结戏曲演唱理论的专著，即燕南之庵的《唱论》，而周德清的《中原音韵》则是北曲最早的韵书，他把北方语言分为十九个韵部，并且把字调分为阴平、阳平、上声、去声四种。这对后世音韵学的研究以及戏曲说唱音乐的发展均有很大的影响。',
				'由于明清社会已经具有资本主义经济因素的萌芽，市民阶层日益壮大，音乐文化的发展更具有世俗化的特点明代的民间小曲内容丰富，虽然良莠不齐，但其影响之广，已经达到"不问男女"，"人人习之"的程度。由此，私人收集编辑，刊刻小曲成风，而且从民歌小曲到唱本，戏文，琴曲均有私人刊本问世。如冯梦龙编辑的《山歌》，朱权编辑的最早的琴曲《神奇秘谱》等。朱载堉他的《乐律全书》对古代文化的最大贡献是他创建了十二平均律。这是音乐学和音乐物理学的一大革命，也是世界科学史上的一大发明。\n明清时期说唱音乐异彩纷呈。其中南方的弹词，北方的鼓词，以及牌子曲，琴书，道情类的说唱曲种更为重要。南方秀丽的弹词以苏州弹词影响最大。在清代，苏州出现了以陈遇干为代表的苍凉雄劲的陈调；以马如飞为代表的爽直酣畅的马调；以俞秀山为代表的秀丽柔婉的俞调这三个重要流派。以后又繁衍出许多新的流派。北方的鼓词以山东大鼓，冀中的木板大鼓、西河大鼓、京韵大鼓较为重要。而牌子曲类的说唱有单弦，河南大调曲子等；琴书类说唱有山东琴书，四川扬琴等；道情类说唱有浙江道情，陕西道情，湖北渔鼓等。 明初四大声腔有海盐、余姚、弋阳、昆山诸腔，其中的昆山腔经由江苏太仓魏良甫等人的改革，以曲调细腻流畅，发音讲究字头、字腹、字尾而赢得人们的喜爱。昆山腔又经过南北曲的汇流，形成了一时为戏曲之冠的昆剧。最早的昆剧剧目是明梁辰鱼的《浣纱记》，其余重要的剧目如明汤显祖的《牡丹亭》、清洪升的《长生殿》等。弋阳腔以其灵活多变的特点对各地的方言小戏发生重要影响，使得各地小戏日益增多，如各种高腔戏。明末清初，北方以陕西西秦腔为代表的梆子腔得到很快的发展，它影响到山西的蒲州梆子、陕西的同州梆子、河北梆子、河南梆子。这种高亢、豪爽的梆子腔在北方各省经久不衰。晚清，由西皮和二黄两种基本曲调构成的皮黄腔，在北京初步形成，由此，产生了影响遍及全国的京剧。\n明清时期，器乐的发展表现为民间出现了多种器乐合奏的形式。如北京的智化寺管乐，河北吹歌，江南丝竹，十番锣鼓等等。明代的《平沙落雁》、清代的《流水》等琴曲以及一批丰富的琴歌《阳关三叠》、《胡笳十八拍》等广为流传。琵琶乐曲自元末明初有《海青拿天鹅》以及《十面埋伏》等名曲问世，至清代还出现了华秋萍编辑的最早的《琵琶谱》。明代末叶，著名的乐律学家朱载育计算出十二平均律的相邻两个律（半音）间的长度比值，精确到二十五位数字，这一律学上的成就在世界上是首创。'
			],
		}
	},
	computed: {
		formattedText() {
			return this.msg.split('\n').map(paragraph => `<p>${paragraph}</p>`).join('');
		}
	},
	// 刚进入页面时
	methods: {
		select(index) {
			this.selectedIndex = index;
		},
		// 点击按钮，显示对应的历史内容
	}
}
</script>

<style>
#welcome {
	width: 100vw;
	top: 1vw;
}

/* 第一页的样式 */
#welcome img {
	width: 100%;
	top: 0;
}

#welcome .text {
	position: absolute;
	transform: translate(-50%, -50%);
	color: white;
	font-weight: bold;
	text-align: left;
	opacity: 70%;
	white-space: nowrap;
}

#welcome h1 {
	top: 18vw;
	left: 45vw;
	font-size: 8em;
}

#welcome h2 {
	top: 29vw;
	left: 45vw;
	font-size: 4.2em;
	opacity: 80%;
	font-weight: 200;
}

/* 第二页的样式 */
#history {
	width: 100%;
	display: flex;
}

h1 {
	text-align: center;
	font-size: 3.5em;
	margin-top: 3.5vw;
	margin-bottom: 3vw;
	font-weight: 550;
	color: #635cE6;
}

#content {
	width: 70vw;
	margin: 0;
	padding: 0;
	background-color: #E8D8F6;
	border-radius: 30px;
	margin-left: 5vw;
	font-size: 1.5em;
	text-align: center;
	display: flex;
	align-items: center;
	text-align: left;
	white-space: pre-wrap;
	position: relative;
	text-indent: 2em;
}

/* 翻页键的样式 */
#content button {
	width: 0;
	height: 0;
	border-left: 25px solid transparent;
	border-right: 25px solid transparent;
	border-bottom: 50px solid #cccccc;
	background: transparent;
	border-top: none;
	outline: none;
	cursor: pointer;
	position: absolute;
}

#content button:nth-of-type(1) {
	/* 右按钮 */
	right: 2vw;
	bottom: 2vw;
	transform: rotate(90deg);
}

#content button:nth-of-type(2) {
	/* 左按钮 */
	right: 8vw;
	bottom: 2vw;
	transform: rotate(270deg);
}

/* 按钮组的样式 */
ul {
	width: 17vw;
	margin: 0;
	padding: 2px;
}

button {
	width: 100%;
	height: 6vw;
	font-size: 1.8em;
	word-wrap: break-word;
	border-left: 0.2px solid #543624;
	border-right: 0.3px solid #543624;
	border-top: 0.2px solid #543624;
	border-bottom: 0.2px solid #543624;
}

button .selected {
	color: #905CE6;
}
</style>